import './sass/matrix.scss';

function Matrix() {
  const sloks = [
    'असक्तबुद्धि: सर्वत्र जितात्मा विगतस्पृह:',
    ' | नैष्कर्म्यसिद्धिं परमां सन्न्यासेनाधिगच्छति ||',
    'यं हि न व्यथयन्त्येते पुरुषं पुरुषर्षभ ',
    ' | समदु:खसुखं धीरं सोऽमृतत्वाय कल्पते ||',
    'य एनं वेत्ति हन्तारं यश्चैनं मन्यते हतम् ',
    ' | उभौ तौ न विजानीतो नायं हन्ति न हन्यते ||',
    'जातस्य हि ध्रुवो मृत्युर्ध्रुवं जन्म मृतस्य च ',
    ' | तस्मादपरिहार्येऽर्थे न त्वं शोचितुमर्हसि ||',
    'सुखदु:खे समे कृत्वा लाभालाभौ जयाजयौ ',
    ' | ततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि ||',
    'यथैधांसि समिद्धोऽग्निर्भस्मसात्कुरुतेऽर्जुन ',
    ' | ज्ञानाग्नि: सर्वकर्माणि भस्मसात्कुरुते तथा ||',
    'बन्धुरात्मात्मनस्तस्य येनात्मैवात्मना जित: ',
    ' | अनात्मनस्तु शत्रुत्वे वर्ते तात्मैव शत्रुवत् ||',
    'सुहृन्मित्रार्युदासीनमध्यस्थद्वेष्यबन्धुषु ',
    ' | साधुष्वपि च पापेषु समबुद्धिर्विशिष्यते ||',
    'वासांसि जीर्णानि यथा विहाय नवानि गृह्णाति नरोऽपराणि ',
    ' | तथा शरीराणि विहाय जीर्णा न्यन्यानि संयाति नवानि देही ||',
    'हतो वा प्राप्स्यसि स्वर्गं जित्वा वा भोक्ष्यसे महीम् ',
    ' | तस्मादुत्तिष्ठ कौन्तेय युद्धाय कृतनिश्चय: ||',
  ];
  return (
    <div className="matrix-holder">
      {sloks.map((slok, i) => (
        <span
          key={i}
          style={{ animationDelay: `${Math.floor(Math.random() * 20)}s` }}
        >
          {slok}
        </span>
      ))}
    </div>
  );
}
export default Matrix;
